matthewclaude/bedknob-for-somnus/firmware/dial-idf/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=10000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=20
CONFIG_LV_INDEV_DEF_READ_PERIOD=20
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_QRCODE=y
# OTA rollback: new firmware must mark itself valid after a health check,
# else the bootloader reverts to the previous slot on reboot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# No code calls esp_crt_bundle_attach() -- TLS verifies against the curated
# PEM in components/dial_ota/trust_roots.pem instead, embedded by dial_ota
# (EMBED_TXTFILES) and used only for GitHub (the OTA check and download);
# the pad client (dial_somnus) is plain HTTP with no TLS at all. Drop the
# compiled-in bundle to reclaim flash.
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE is not set

# app_main's task carries the boot-time UI bring-up, and the router copies a
# ~1.4KB app_state_t snapshot per frame (dispatch + the screen's on_state
# nest two of them). The 3584-byte default left no headroom: adding two
# sub-screens in v1.1.0 overflowed it and boot-looped the dial. 6144 restores
# a real margin; the main task is deleted once app_main returns, so this is
# transient boot RAM, not a permanent cost.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# TLS buffers out of scarce internal RAM and into the 8MB PSRAM. Set on
# 2026-07-28, when a GitHub handshake failed outright for want of internal
# memory ("check failed (HTTP -1)"). The OTA client (dial_ota) is the only
# TLS user today -- the pad client is plain HTTP -- but the setting stays: a
# GitHub handshake alongside the LVGL frame buffers and the Wi-Fi/lwIP
# buffers still wants its TLS buffers in PSRAM, not internal RAM.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
